Revit 2020 API
OpenConflictScenario Enumeration
 The kinds of conflicts happened during open.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2019
Since: 2019
Syntax
C#
public enum OpenConflictScenario
Visual Basic
Public Enumeration OpenConflictScenario
Visual C++
public enum class OpenConflictScenario
Members
Member name | Description
Rollback |  Central model is restored to an earlier version.
Relinquished |  Ownership to model elements is relinquished.
OutOfDate |  Model is out of date.
See Also
Autodesk.Revit.DB Namespace